benchmark/go-frameworks/results/20260924-102750/results/post/stdlib/r1/60000.txt
Running 40s test @ http://10.128.0.4:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.233ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.233ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.222ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.231ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.242ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.248ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.372ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.227ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.235ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.250ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.226ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.269ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.241ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.240ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.225ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20ms  849.57us  18.91ms   85.98%
    Req/Sec     3.96k   496.72     7.30k    80.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.45ms
 90.000%    1.92ms
 99.000%    4.55ms
 99.900%    8.63ms
 99.990%   13.27ms
 99.999%   16.88ms
100.000%   18.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.090     0.000000            1         1.00
       0.443     0.100000       179421         1.11
       0.623     0.200000       358754         1.25
       0.782     0.300000       537793         1.43
       0.929     0.400000       716456         1.67
       1.071     0.500000       895467         2.00
       1.142     0.550000       984642         2.22
       1.215     0.600000      1075233         2.50
       1.289     0.650000      1164453         2.86
       1.366     0.700000      1253655         3.33
       1.450     0.750000      1343299         4.00
       1.497     0.775000      1387450         4.44
       1.552     0.800000      1432671         5.00
       1.615     0.825000      1477411         5.71
       1.690     0.850000      1521874         6.67
       1.786     0.875000      1566832         8.00
       1.845     0.887500      1588863         8.89
       1.917     0.900000      1611349        10.00
       2.008     0.912500      1633674        11.43
       2.131     0.925000      1656040        13.33
       2.311     0.937500      1678485        16.00
       2.429     0.943750      1689685        17.78
       2.567     0.950000      1700845        20.00
       2.725     0.956250      1711964        22.86
       2.907     0.962500      1723208        26.67
       3.121     0.968750      1734401        32.00
       3.243     0.971875      1739958        35.56
       3.379     0.975000      1745519        40.00
       3.537     0.978125      1751139        45.71
       3.727     0.981250      1756697        53.33
       3.959     0.984375      1762316        64.00
       4.089     0.985938      1765084        71.11
       4.247     0.987500      1767948        80.00
       4.423     0.989062      1770705        91.43
       4.647     0.990625      1773490       106.67
       4.923     0.992188      1776276       128.00
       5.095     0.992969      1777697       142.22
       5.291     0.993750      1779079       160.00
       5.507     0.994531      1780466       182.86
       5.787     0.995313      1781880       213.33
       6.115     0.996094      1783269       256.00
       6.307     0.996484      1783963       284.44
       6.531     0.996875      1784673       320.00
       6.767     0.997266      1785359       365.71
       7.059     0.997656      1786065       426.67
       7.423     0.998047      1786764       512.00
       7.599     0.998242      1787108       568.89
       7.819     0.998437      1787458       640.00
       8.063     0.998633      1787808       731.43
       8.327     0.998828      1788162       853.33
       8.687     0.999023      1788513      1024.00
       8.871     0.999121      1788680      1137.78
       9.087     0.999219      1788855      1280.00
       9.391     0.999316      1789036      1462.86
       9.671     0.999414      1789207      1706.67
      10.047     0.999512      1789380      2048.00
      10.287     0.999561      1789467      2275.56
      10.503     0.999609      1789557      2560.00
      10.775     0.999658      1789642      2925.71
      11.071     0.999707      1789732      3413.33
      11.447     0.999756      1789818      4096.00
      11.687     0.999780      1789862      4551.11
      11.919     0.999805      1789906      5120.00
      12.127     0.999829      1789948      5851.43
      12.415     0.999854      1789991      6826.67
      12.895     0.999878      1790037      8192.00
      13.087     0.999890      1790059      9102.22
      13.327     0.999902      1790079     10240.00
      13.711     0.999915      1790103     11702.86
      13.943     0.999927      1790122     13653.33
      14.191     0.999939      1790144     16384.00
      14.391     0.999945      1790155     18204.44
      14.535     0.999951      1790166     20480.00
      14.679     0.999957      1790177     23405.71
      15.135     0.999963      1790188     27306.67
      15.751     0.999969      1790199     32768.00
      15.975     0.999973      1790204     36408.89
      16.135     0.999976      1790210     40960.00
      16.343     0.999979      1790215     46811.43
      16.479     0.999982      1790222     54613.33
      16.575     0.999985      1790226     65536.00
      16.671     0.999986      1790230     72817.78
      16.751     0.999988      1790232     81920.00
      16.799     0.999989      1790234     93622.86
      16.959     0.999991      1790237    109226.67
      17.039     0.999992      1790240    131072.00
      17.183     0.999993      1790241    145635.56
      17.327     0.999994      1790243    163840.00
      17.471     0.999995      1790244    187245.71
      17.503     0.999995      1790245    218453.33
      17.871     0.999996      1790248    262144.00
      17.871     0.999997      1790248    291271.11
      17.871     0.999997      1790248    327680.00
      17.903     0.999997      1790249    374491.43
      17.903     0.999998      1790249    436906.67
      18.063     0.999998      1790250    524288.00
      18.063     0.999998      1790250    582542.22
      18.303     0.999998      1790251    655360.00
      18.303     0.999999      1790251    748982.86
      18.303     0.999999      1790251    873813.33
      18.799     0.999999      1790252   1048576.00
      18.799     0.999999      1790252   1165084.44
      18.799     0.999999      1790252   1310720.00
      18.799     0.999999      1790252   1497965.71
      18.799     0.999999      1790252   1747626.67
      18.927     1.000000      1790253   2097152.00
      18.927     1.000000      1790253          inf
#[Mean    =        1.203, StdDeviation   =        0.850]
#[Max     =       18.912, Total count    =      1790253]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2388418 requests in 40.00s, 391.78MB read
Requests/sec:  59714.40
Transfer/sec:      9.80MB